{
    "job_details": {
        "job_id": "4034180416",
        "job_title": "GCP Data Engineer-India",
        "company": {
            "name": "Globant",
            "location": "Pune, Maharashtra, India"
        },
        "job_description": {
            "overview": "We are a digitally native company that helps organizations reinvent themselves and unleash their potential. We are the place where innovation, design and engineering meet scale. Globant is 21 years old, NYSE listed public organization with more than 29,000 employees worldwide working out of 33 countries globally.",
            "details": "\nwww.globant.com\n\nRight now, we are looking for GCP Data Engineers to join our team at Globant!\n\nYou will get the chance to:\n\nWork with professionals who have created some of the most revolutionary solutions in their fields.\nMake an impact. Work in large-scale projects globally.\nDevelop your career in our Studios. Each Studio represents deep pockets of expertise on the latest technologies and trends and delivers tailored solutions focused on specific challenges.\nDevelop your career within an industry or multiple industries.\nWork in the city you want, and be nourished by cultural exchanges.\nBe empowered to choose your career path: we have more than 600 simultaneous projects, so you can choose where and how to work.\nBe part of an agile pod. Driven by a culture of self-regulated teamwork, each team -or POD- works directly with our customers with a full maturity path that evolves as they increase speed, quality and autonomy.\n\n\nWhat would help you succeed:\n\nBelieve and love what you do.\nEnjoy solving problems.\nHave imagination and you love innovating.\nBeing flexible & goal oriented.\nAdvanced English skills.\nHigh performance analytics.\nBachelor Degree in CV, Information Technology or related technical field.\nPractical experience in Google Cloud Platform, using at least this part of the stack: Apache Beam, DataFlow, DataProc, DataPrep (is a plus!), Big Query and Cloud Storage.\n\n\nAre you ready?\n\nJob Segment: Database, Cloud, Engineer, Technology, Engineering"
        }
    }
}