{
    "job_details": {
        "job_id": "4073957777",
        "job_title": "Data Engineer Intern",
        "company": {
            "name": "EVERSANA",
            "location": "Bengaluru, Karnataka, India"
        },
        "job_description": {
            "overview": "At EVERSANA, we are proud to be certified as a Great Place to Work across the globe. We’re fueled by our vision to create a healthier world. How? Our global team of more than 7,000 employees is committed to creating and delivering next-generation commercialization services to the life sciences industry. We are grounded in our cultural beliefs and serve more than 650 clients ranging from innovative biotech start-ups to established pharmaceutical companies. Our products, services and solutions help bring innovative therapies to market and support the patients who depend on them. Our jobs, skills and talents are unique, but together we make an impact every day. Join us!",
            "details": "\nAcross our growing organization, we embrace diversity in backgrounds and experiences. Improving patient lives around the world is a priority, and we need people from all backgrounds and swaths of life to help build the future of the healthcare and the life sciences industry. We believe our people make all the difference in cultivating an inclusive culture that embraces our cultural beliefs. We are deliberate and self-reflective about the kind of team and culture we are building. We look for team members that are not only strong in their own aptitudes but also who care deeply about EVERSANA, our people, clients and most importantly, the patients we serve. We are EVERSANA.\n\nPosition\n\nJob Description\n\nAn intern at Eversana reports to Sr Associate. Internship at Eversana is a 6 months program where in candidate will be given a project to manage the pharmaceutical data. Full time job will be offered to the candidate, based on the performance of the candidate and requirement in the company at the end of internship period.\n\nResponsibilities\n\nCreate SQL, PL/SQL code to fulfil the data extraction or loading requirements with optimal performance\nApply DBMS concepts to design and maintain database objects while ensuring its stability, reliability, and performance\nCreate Data load pipelines to facilitate data transfer from source to target by following best practices\nValidate the data loads by executing standard data quality checks\nTroubleshoot and debug data load issues\nCreate / Enhance Python scripts to support and control data load processes\nCreate Reports to cater to reporting needs of business users by understanding the required KPIs\nCreating content to accelerate project kickoff and project closure with standard practices, including maintaining project repositories, updating issue trackers, participating in code reviews, and performing thorough testing.\n\nRequirements\n\nBachelor's or master's degree in engineering (any branch) / Computer Science field, and strong academic performance with analytic and quantitative coursework is required\nMinimum 1 year of relevant post-collegiate job experience\nKnowledge of SQL, PL/SQL, any ETL Tool, any reporting tool, Python is a big plus\nHigh motivation, good work ethic, proactive approach\nStrong oral and written communication skills\nFlexibility to adapt to changing technology needs\nClose attention to detail, with a quality-focused mindset\nSelf-discipline for planning and organizing tasks\nAbility to work in teams\n\nQualifications\n\nEDUCATIONAL QUALIFICATIONS\n\nBachelor’s degree in engineering, Technology, or Computer Science\n\nAdditional Information\n\nOUR CULTURAL BELIEFS:\n\nPatient Minded I act with the patient’s best interest in mind.\n\nClient Delight I own every client experience and its impact on results.\n\nTake Action I am empowered and hold myself accountable.\n\nEmbrace Diversity I create an environment of awareness and respect.\n\nGrow Talent I own my development and invest in the development of others.\n\nWin Together I passionately connect with anyone, anywhere, anytime to achieve results.\n\nCommunication Matters I speak up to create transparent, thoughtful, and timely dialogue.\n\nAlways Innovate I am bold and creative in everything I do.\n\nEVERSANA is committed to providing competitive salaries and benefits for all employees. The anticipated base salary range for this position is $115,000 to $130,000 and is not applicable to locations outside of the U.S. The base salary range represents the low and high end of the salary range for this position. Compensation will be determined based on relevant experience, other job-related qualifications/skills, and geographic location (to account for comparative cost of living). EVERSANA reserves the right to modify this base salary range at any time.\n\nOur team is aware of recent fraudulent job offers in the market, misrepresenting EVERSANA. Recruitment fraud is a sophisticated scam commonly perpetrated through online services using fake websites, unsolicited e-mails, or even text messages claiming to be a legitimate company. Some of these scams request personal information and even payment for training or job application fees. Please know EVERSANA would never require personal information nor payment of any kind during the employment process. We respect the personal rights of all candidates looking to explore careers at EVERSANA.\n\nFrom EVERSANA’s inception, Diversity, Equity & Inclusion have always been key to our success. We are an Equal Opportunity Employer, and our employees are people with different strengths, experiences, and backgrounds who share a passion for improving the lives of patients and leading innovation within the healthcare industry. Diversity not only includes race and gender identity, but also age, disability status, veteran status, sexual orientation, religion, and many other parts of one’s identity. All of our employees’ points of view are key to our success, and inclusion is everyone's responsibility.\n\nFollow us on LinkedIn | Twitter"
        }
    }
}