{
    "job_details": {
        "job_id": "4074072843",
        "job_title": "Data Engineer",
        "company": {
            "name": "STOXX",
            "location": "Mumbai Metropolitan Region"
        },
        "job_description": {
            "overview": "Let’s be #BrilliantTogether",
            "details": "\nISS STOXX is looking for a Data Engineer to join our team in Mumbai, India.\n\nOverview\n\nWe are seeking a talent to bring technical expertise to the development and deployment of our cutting-edge financial intelligence platform. In this role, you will leverage your technical expertise and innovative mindset to lead the design, implementation, operation and optimization of our data platform, ensuring its ability to deliver efficient and reliable data services to our global client base. As a critical member of technical team, you will collaborate with cross-functional peers and stakeholders to drive continuous improvement initiatives and ensure our data pipelines remain at the forefront of investment management technology.\n\nResponsibilities\n\nContribute to the development and operationalisation of Stoxx's market data pipelines\nEnsure the platform's scalability, reliability, and efficiency meet business and client needs\nFocus on continuous delivery and observability\nCollaborate with cross-functional teams to implement the market data roadmap\nDrive continuous improvement initiatives to enhance pipeline performance and customer satisfaction\nKeep abreast of emerging trends and technologies in cloud data management and operation\n\nQualification\n\n2+ years' experience in data engineering, with a focus on cloud data solutions and implementations\nExperience with the development and deployment of large-scale, complex data pipelines\nStrong knowledge of GCP products across database, serverless, containerization and API\nExperience with serverless solution design and implementation\nExperience coaching and mentoring high-performing teams\nPragmatic experience using agile to deliver incremental value\nExperience working in a global or multinational team setting\nStrong communication and collaboration skills\nProven ability to drive innovation and continuous improvement initiatives\nFocus on simplicity, automation and observability\nBachelor's or Master's degree in Computer Science or related field\nExpertise in DBT, Python, SQL, Apigee, Airflow\nDomain knowledge of financial market data and financial index data models and feeds will be an added advantage.\n\n#ASSOCIATE\n\n#STOXX\n\nWhat You Can Expect From Us\n\nOur people are the moving force behind ISS STOXX. We are dedicated to hiring the best, most talented people in our industry and empowering them with the resources and support to enhance their career, health, financial and personal well-being.\n\nWe are committed to fostering, cultivating, and preserving a culture of diversity and inclusion. We are invested in our people and are working every day to ensure a diverse, equitable, and inclusive workplace.\n\nLet’s empower, collaborate, and inspire one another.\n\nLet’s be #BrilliantTogether.\n\nAbout ISS STOXX\n\nISS STOXX GmbH is a leading provider of research and technology solutions for the financial market. Established in 1985, we offer top-notch benchmark and custom indices globally, helping clients identify investment opportunities and manage portfolio risks. Our services cover corporate governance, sustainability, cyber risk, and fund intelligence. Majority-owned by Deutsche Börse Group, ISS STOXX has over 3,400 professionals in 33 locations worldwide, serving around 6,400 clients, including institutional investors and companies focused on ESG, cyber, and governance risk. Clients trust our expertise to make informed decisions for their stakeholders' benefit.\n\nSTOXX® and DAX® indices comprise a global and comprehensive family of more than 17,000 strictly rules-based and transparent indices. Best known for the leading European equity indices EURO STOXX 50®, STOXX® Europe 600 and DAX®, the portfolio of index solutions consists of total market, benchmark, blue-chip, sustainability, thematic and factor-based indices covering a complete set of world, regional and country markets. STOXX and DAX indices are licensed to more than 550 companies around the world for benchmarking purposes and as underlyings for ETFs, futures and options, structured products, and passively managed investment funds. STOXX Ltd., part of the ISS STOXX group of companies, is the administrator of the STOXX and DAX indices under the European Benchmark Regulation.\n\nVisit our website: https://www.issgovernance.com\n\nView additional open roles: https://www.issgovernance.com/join-the-iss-team/\n\nInstitutional Shareholder Services (“ISS”) is committed to fostering, cultivating, and preserving a culture of diversity and inclusion. It is our policy to prohibit discrimination or harassment against any applicant or employee on the basis of race, color, ethnicity, creed, religion, sex, age, height, weight, citizenship status, national origin, social origin, sexual orientation, gender identity or gender expression, pregnancy status, marital status, familial status, mental or physical disability, veteran status, military service or status, genetic information, or any other characteristic protected by law (referred to as “protected status”). All activities including, but not limited to, recruiting and hiring, recruitment advertising, promotions, performance appraisals, training, job assignments, compensation, demotions, transfers, terminations (including layoffs), benefits, and other terms, conditions, and privileges of employment, are and will be administered on a non-discriminatory basis, consistent with all applicable federal, state, and local requirements."
        }
    }
}