{
    "job_details": {
        "job_id": "4079339745",
        "job_title": "Python Developer - Digital Solution Consultant Sr. Analyst",
        "company": {
            "name": "NTT DATA North America",
            "location": "Bengaluru East, Karnataka, India"
        },
        "job_description": {
            "overview": "Req ID: 303407",
            "details": "\nNTT DATA strives to hire exceptional, innovative and passionate individuals who want to grow with us. If you want to be part of an inclusive, adaptable, and forward-thinking organization, apply now.\n\nWe are currently seeking a Python Developer - Digital Solution Consultant Sr. Analyst to join our team in Bangalore, Karnātaka (IN-KA), India (IN).\n\nTitle – Python Developer\n\nLocation: Bangalore Preferred or Remote\n\nResponsibilities:\n\nDrive architecture and designs to become simpler, more robust, and more efficient.\nGather Functional requirements from Product Management Group and/or internal customers and end-users, and translate requirements into technical specifications to build robust, scalable, supportable solutions that work well between a range of complex systems.\nServe as technical lead throughout the full development lifecycle, end-to-end, from scoping, planning, conception, design, implementation, and testing, to documentation, delivery, and maintenance.\nProvide design reviews for other engineers, including feedback on architecture and design issues, as well as integration, performance, and scalability.\nManage resources on multiple technical projects and ensure schedules, milestones, and priorities are compatible with technology and business goals.\n\nRequirements:\n\nBachelor's degree with a minimum of 3 to 6 years of experience in Software development.\nStrong programming experience and background in Python.\nDemonstrable experience designing, building deploying, and maintenance of enterprise cloud solutions (we use Azure).\nHands-on development skills along with architecture/design experience; should not have moved away from software development.\nGood to have experience with DevOps, Infrastructure as Code, and infrastructure automation.\nGood Understanding of secure architectures, secure configuration, and identity management\n\nAbout NTT DATA\n\nNTT DATA is a $30 billion trusted global innovator of business and technology services. We serve 75% of the Fortune Global 100 and are committed to helping clients innovate, optimize and transform for long term success. As a Global Top Employer, we have diverse experts in more than 50 countries and a robust partner ecosystem of established and start-up companies. Our services include business and technology consulting, data and artificial intelligence, industry solutions, as well as the development, implementation and management of applications, infrastructure and connectivity. We are one of the leading providers of digital and AI infrastructure in the world. NTT DATA is a part of NTT Group, which invests over $3.6 billion each year in R&D to help organizations and society move confidently and sustainably into the digital future. Visit us at us.nttdata.com\n\nNTT DATA endeavors to make https://us.nttdata.com accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact us at https://us.nttdata.com/en/contact-us . This contact information is for accommodation requests only and cannot be used to inquire about the status of applications. NTT DATA is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status. For our EEO Policy Statement, please click here . If you'd like more information on your EEO rights under the law, please click here . For Pay Transparency information, please click here ."
        }
    }
}