{
    "job_details": {
        "job_id": "4091184259",
        "job_title": "Python Developer || 4 to 12 Years || Pune & Chennai",
        "company": {
            "name": "Capgemini",
            "location": "Pune, Maharashtra, India"
        },
        "job_description": {
            "overview": "At Capgemini Engineering, the world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.",
            "details": "\nJob Description\n\n4 to 12 years of experience as a Python Developer with a strong portfolio demonstrating your expertise\nGood hands-on knowledge with database technologies such as SQL and NoSQL\nFamiliarity with Snowflake, pyspark, databricks, zookeeper\nGood in Troubleshooting, debugging, maintaining and improving existing software\nExcellent problem-solving abilities with strong communication and collaboration skills.\nCollaborate with cross-functional teams to design and implement innovative solutions.\n\nPrimary Skills\n\nPython\nSQL\n\nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fuelled by its market leading capabilities in AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2023 global revenues of €22.5 billion."
        }
    }
}