{
    "job_details": {
        "job_id": "4096087415",
        "job_title": "Data Engineer - Data Engineering",
        "company": {
            "name": "Bristlecone",
            "location": "Pune, Maharashtra, India"
        },
        "job_description": {
            "overview": "Job Description",
            "details": "\nRole : Junior Python Developer\n\nRole Description\n\nRole played will be that of a Python Developer.\nWill be a good team player.\nWill learn the project functionality quickly and start the development as soon as possible.\nWill be a continuous learner of technology\nWill share his learning regarding the project functionality with the team.\nWill have good client facing skills and win client confidence as soon as possible.\nWill learn to use third party libraries for developing different features.\nWill be participating in peer reviews.\n\nQualifications And Experience\n\nShould have at least 1 year in Python development experience.\nMust have worked on at least 1 project as a Python developer.\n\nTechnical Skills\n\nShould be well versed with data structures.\nShould be well versed with OOPs concepts.\nShould be well versed with reading and writing files.\nShould be well versed with Error and Exception handling.\nShould be aware of the following modules of Python Standard Library\nOperating System Interface\nFile Wildcards\nCommand Line Arguments\nString Pattern Matching\nDates and Times\nInternet Access\nShould be aware of the basic Python coding standards.\nShould be aware of using at least 2-3 third party libraries e.g. Django, Flask, Pyramid\nBehavioural And Soft Skills\n\nProactive\nQuick Learner\nGood analytical and programming skills\nTeamwork\nCustomer Sensitivity\nExcellent verbal and written communication\n\nResponsibilities\n\nQUALIFICATIONS\n\nAbout Us\n\nABOUT US\n\nBristlecone is the leading provider of AI-powered application transformation services for the connected supply chain. We empower our customers with speed, visibility, automation, and resiliency – to thrive on change.\n\nOur transformative solutions in Digital Logistics, Cognitive Manufacturing, Autonomous Planning, Smart Procurement and Digitalization are positioned around key industry pillars and delivered through a comprehensive portfolio of services spanning digital strategy, design and build, and implementation across a range of technology platforms.\n\nBristlecone is ranked among the top ten leaders in supply chain services by Gartner. We are headquartered in San Jose, California, with locations across North America, Europe and Asia, and over 2,500 consultants. Bristlecone is part of the $19.4 billion Mahindra Group.\n\nEqual Opportunity Employer\n\nBristlecone is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status .\n\nInformation Security Responsibilities\n\nUnderstand and adhere to Information Security policies, guidelines and procedure, practice them for protection of organizational data and Information System.\nTake part in information security training and act while handling information.\nReport all suspected security and policy breach to InfoSec team or appropriate authority (CISO).\nUnderstand and adhere to the additional information security responsibilities as part of the assigned job role."
        }
    }
}