{
    "job_details": {
        "job_id": "4106762786",
        "job_title": "IN-Associate_Cloud Data Engineer-- Data and Analytics_Advisory_Pan India",
        "company": {
            "name": "PwC India",
            "location": "Gurugram, Haryana, India"
        },
        "job_description": {
            "overview": "Line of Service",
            "details": "\nAdvisory\n\nIndustry/Sector\n\nNot Applicable\n\nSpecialism\n\nData, Analytics & AI\n\nManagement Level\n\nAssociate\n\nJob Description & Summary\n\nAt PwC, our people in data and analytics engineering focus on leveraging advanced technologies and techniques to design and develop robust data solutions for clients. They play a crucial role in transforming raw data into actionable insights, enabling informed decision-making and driving business growth.\n\nIn data engineering at PwC, you will focus on designing and building data infrastructure and systems to enable efficient data processing and analysis. You will be responsible for developing and implementing data pipelines, data integration, and data transformation solutions.\n\nWhy PWC\n\n\nAt PwC, you will be part of a vibrant community of solvers that leads with trust and creates distinctive outcomes for our clients and communities. This purpose-led and values-driven work, powered by technology in an environment that drives innovation, will enable you to make a tangible impact in the real world. We reward your contributions, support your wellbeing, and offer inclusive benefits, flexibility programmes and mentorship that will help you thrive in work and life. Together, we grow, learn, care, collaborate, and create a future of infinite experiences for each other. Learn more about us.\n\nAt PwC, we believe in providing equal employment opportunities, without any discrimination on the grounds of gender, ethnic background, age, disability, marital status, sexual orientation, pregnancy, gender identity or expression, religion or other beliefs, perceived differences and status protected by law. We strive to create an environment where each one of our people can bring their true selves and contribute to their personal growth and the firm’s growth. To enable this, we have zero tolerance for any discrimination and harassment based on the above considerations. \"\n\nJob Description & Summary: A career within PWC\n\nResponsibilities\n\nWe are seeking skilled and dynamic Cloud Data Engineers specializing in AWS, Azure, Databricks, and GCP. The ideal candidate will have a strong background in data engineering, with a focus on data ingestion, transformation, and warehousing. They should also possess excellent knowledge of PySpark or Spark, and a proven ability to optimize performance in Spark job executions.\n\nDesign, build, and maintain scalable data pipelines for a variety of cloud platforms including AWS, Azure, Databricks, and GCP.\nImplement data ingestion and transformation processes to facilitate efficient data warehousing.\nUtilize cloud services to enhance data processing capabilities:\nAWS: Glue, Athena, Lambda, Redshift, Step Functions, DynamoDB, SNS.\nAzure: Data Factory, Synapse Analytics, Functions, Cosmos DB, Event Grid, Logic Apps, Service Bus.\nGCP: Dataflow, BigQuery, DataProc, Cloud Functions, Bigtable, Pub/Sub, Data Fusion.\nOptimize Spark job performance to ensure high efficiency and reliability.\nStay proactive in learning and implementing new technologies to improve data processing frameworks.\nCollaborate with cross-functional teams to deliver robust data solutions.\nWork on Spark Streaming for real-time data processing as necessary.\n\n\nQualifications\n\n2-4 years of experience in data engineering with a strong focus on cloud environments.\nProficiency in PySpark or Spark is mandatory.\nProven experience with data ingestion, transformation, and data warehousing.\nIn-depth knowledge and hands-on experience with cloud services(AWS/Azure/GCP):\nDemonstrated ability in performance optimization of Spark jobs.\nStrong problem-solving skills and the ability to work independently as well as in a team.\nCloud Certification (AWS, Azure, or GCP) is a plus.\nFamiliarity with Spark Streaming is a bonus.\n\n\nMandatory Skill Sets\n\nPython, Pyspark, SQL with (AWS or Azure or GCP)\n\nPreferred Skill Sets\n\nPython, Pyspark, SQL with (AWS or Azure or GCP)\n\nYears Of Experience Required\n\n2-4 years\n\nEducation Qualification\n\nBE/BTECH, ME/MTECH, MBA, MCA\n\nEducation (if blank, degree and/or field of study not specified)\n\nDegrees/Field of Study required: Bachelor of Engineering, Master of Business Administration, Master of Engineering\n\nDegrees/Field Of Study Preferred\n\nCertifications (if blank, certifications not specified)\n\nRequired Skills\n\nCloud Engineering\n\nOptional Skills\n\nAccepting Feedback, Accepting Feedback, Active Listening, Agile Scalability, Amazon Web Services (AWS), Apache Hadoop, Azure Data Factory, Communication, Data Anonymization, Database Administration, Database Management System (DBMS), Database Optimization, Database Security Best Practices, Data Engineering, Data Engineering Platforms, Data Infrastructure, Data Integration, Data Lake, Data Modeling, Data Pipeline, Data Quality, Data Transformation, Data Validation, Data Warehouse, Data Warehouse Indexing {+ 13 more}\n\nDesired Languages (If blank, desired languages not specified)\n\nTravel Requirements\n\nNot Specified\n\nAvailable for Work Visa Sponsorship?\n\nNo\n\nGovernment Clearance Required?\n\nNo\n\nJob Posting End Date"
        }
    }
}