{
    "job_details": {
        "job_id": "4107247561",
        "job_title": "Associate Creative Director",
        "company": {
            "name": "VML",
            "location": "New York, NY"
        },
        "job_description": {
            "overview": "Who We Are: At VML, we are a beacon of innovation and growth in an ever-evolving world. Our heritage is built upon a century of combined expertise, where creativity meets technology, and diverse perspectives ignite inspiration. With the merger of VMLY&R and Wunderman Thompson, we have forged a new path as a growth partner that is part creative agency, part consultancy, and part technology powerhouse.",
            "details": "\nOur global family now encompasses over 30,000 employees across 150+ offices in 64 markets, each contributing to a culture that values connection, belonging, and the power of differences.\n\nOur expertise spans the entire customer journey, offering deep insights in communications, commerce, consultancy, CRM, CX, data, production, and technology. We deliver end-to-end solutions that result in revolutionary work.\n\nRequired Skills Substantial experience in copywriting across multiple mediums, including television, digital, print, and experiential, with a strong portfolio showcasing exceptional storytelling skills and creative versatility. Polished client presentation skills demonstrating a clear vision of how the work addresses the client challenge Demonstrated leadership experience, with the ability to inspire and mentor copywriters and creative teams to produce high-quality work that aligns with brand objectives and resonates emotionally with audiences. Experience in crafting long-form documentaries and episodic storytelling pieces, with a focus on authentic, heartfelt storytelling that resonates emotionally with audiences and drives narrative engagement. Strong collaboration and communication skills, with the ability to work closely with cross-functional teams to bring creative concepts to life and ensure alignment with brand objectives. Required Experience A bachelor’s degree, writing emphasis preferred Seven-plus years of experience in an agency setting The base salary range for this position at the time of this posting is indicated below. Individual compensation varies based on job-related factors, including location, business needs, level of responsibility, experience, and qualifications. We offer a competitive benefits package, click WPP Benefits for more details._$75,000—$180,000 USDAt VML, we are committed to fostering an all-inclusive work environment that is both rewarding and career-forward. Our Inclusion, Equity & Belonging initiatives, alongside the VML Foundation, reflect our dedication to giving back and making a positive impact in our communities and beyond. Our people are the heartbeat of our organization—creators, doers, innovators, makers, and thinkers—who drive not just marketing, but meaningful experiences that resonate in every action and interaction.\n\nVML is a WPP Agency. For more information, please visit our website, and follow VML on our social channels via Instagram, LinkedIn, and X.\n\nWhen you click \"Submit Application\", this will send any information you add below to VML. Before you do this, we think it's a good idea to read through our Recruitment Privacy Policy. California residents should read our California Recruitment Privacy Notice. This explains what we do with your personal data when you apply for a role with us, and, how you can update the information you have provided us with or how to remove it."
        }
    }
}