{
    "job_details": {
        "job_id": "4112595648",
        "job_title": "Senior Producer, Creative & Content",
        "company": {
            "name": "Los Angeles Lakers",
            "location": "El Segundo, CA"
        },
        "job_description": {
            "overview": "Job Title: Senior Producer, Creative and Content",
            "details": "\nDepartment: Marketing\n\nReports to: Creative Director\n\nManages: Video Production Team, Video Producers, Video Editors, Writers\n\nCollaboration: Daily collaboration with the Video Production team, broader Creative and Content team, Integrated Marketing, Brand Strategy and Marketing Operations; Regular collaboration with leaders across the organization including Game Operations, Basketball Operations, Ticketing, Corporate Partnerships, Community, Communications, Facilities and HR\n\nTeam Overview: Creative and Content is part of the marketing department, leading brand identity, visual design and art direction for the Los Angeles Lakers, South Bay Lakers and Lakers Gaming. The team is responsible for generating creative ideas and forming campaign concepts to achieve long-term and short-term business objectives, guided by the broader marketing team. The creative and content team designs and delivers creative stories and assets to serve a variety of organization needs prioritizing brand storytelling, fan engagement, broadcast support, corporate partnerships and season ticket members. This team is responsible for producing creative and editorial content daily during the season to tell the basketball story. Creative and Content also serves the broader business, supporting longer-term fan engagement, international growth, basketball operations, community programs, DEIB initiatives and internal employee programming.\n\nPosition Summary: Senior Producer, Creative and Content oversees all stages of video content production—pre-production, production, and post-production—across multiple platforms. This leadership role is responsible for shaping storylines and driving scripting, while collaborating with a wide variety cross-functional teams to coordinate all production needs. The ideal candidate is a creative and strategic professional who can lead the video storytelling process from concept through final delivery, navigating regulations and roadblocks with ease. While expertise in shooting video is not required, prior experience in this area is valuable. The ideal candidate will have a strong ability to craft compelling Lakers-related stories and deliver them to a global audience with impact and creativity.\n\nEssential Functions (Duties & Responsibilities**):\n\nBrand and Campaign Storytelling\n\nPrioritize and produce purposeful and emotional video content that reaches well beyond the day-to-day basketball season and brings consumers from all over the world into the Lakers brand\nCreate, develop and refine compelling storylines and creative direction for a wide range of short form and longer form video content, ensuring alignment with brand objectives and target audience\nLead the creation and development of an authentic and emotional brand anthem film that articulates the Lakers style assembled through decades of championship basketball against the backdrop of Los Angeles\nLead the creation and development of brand videos, leaning into brand DNA and consumer relevancy\nConceive and consider a variety of ways in for video storytelling, maximizing turnkey solutions and delivering diverse formulations to reach a range of consumers\nBring the video storytelling point of view to creative concepting, assessing, evaluating and collaborating on best format to reach consumers based on opportunity and strategic guidance\nEnsure all video content meets the highest standards of quality, consistency, and brand alignment across multiple platforms and formats\nLeads the development of mood boards, storyboards and scriptwriting to outline and sell in concepts\nOrganizes creative ideas into easy-to-digest decks for executive buy-in and internal alignment\n\nEnd-to-End Content Production\n\nLead the entire video production process, from pre-production (concept development, scripting, music considerations) through production (shooting coordination, clearances) to post-production (editing, visual effects, approvals and final delivery)\nReceive and implement direction from brand strategy briefs and integrated marketing plans to ensure content aligns to business objectives\nWork with writers to craft scripts, voiceovers, talent questions and host content as needed, tailoring tone and style to suit different formats and platforms (e.g., YouTube, social media, broadcast)\nPartner with integrated marketing, basketball operations, communications and other departments to assess and fulfill talent requests for production, as needed\nEdit video to support delivery\nTailor content for different platforms, optimizing for engagement, audience growth, and platform-specific requirements (e.g., social media, YouTube, streaming)\nAccept and implement campaign performance learnings and consumer insights for future production\n\nCreative Leadership and Team Management\n\nDrive expectations for the highest quality work, delivered against organization goals\nAdvocate for the most productive and effective use of video formats, recognizing the full creative arsenal and a comprehensive marketing mix\nSupervise and mentor producers, editors, and other production staff, fostering a collaborative, creative and productive work environment\nSupport team development, providing consistent and effective creative reviews and assessments to continually improve quality and increase efficiency\nPartner daily with marketing operations to ensure effective project management and resourcing to meet deadlines and keep pace with the rapid nature of the business\nResponsibilities subject to change based on organizational needs and direction from management.\n\nEducation: Bachelor’s degree in media, communications, or a related field; advanced and continuing education preferred\n\nPrevious Experience\n\nMinimum 8-10 years in video production\nMinimum 5 years management experience overseeing video production teams, including junior producers, editors, and other creative staff\nProven experience creating storylines and producing engaging content for high-profile, premium brands\nStrong background in producing content for culture brands, entertainment, sports, or media\n\nTechnology Capabilities\n\nProficient in industry-standard video editing tools, such as Adobe Premiere Pro, Final Cut Pro, etc.\nUnderstanding of camera operations, including DSLR, mirrorless, and cinema cameras, as well as experience with video lighting, sound equipment, and field production gear (a bonus if you have direct experience with sports broadcasting equipment).\nProject Management Software (Jira, Trello, Wrike, etc.)\nMicrosoft Office (including Excel, Word, Outlook, PowerPoint, SharePoint)\n\nKnowledge, Skills, Abilities\n\nAbility to be guided by and adhere to a strategic brief and translate business objectives and marketing direction into creative narratives, while rolling with the read and react nature of a team business\nCreative and ambitious producer with ability to look beyond traditional methods and embrace restrictions\nFamiliarity with sports media production and the ability to craft stories that resonate with both passionate fanbases and broader audiences\nStoryteller with strong experience in scripting, writing, and editing host content for on-air talent or voiceovers, with the ability to adapt tone and style for different platforms\nProven track record of working effectively across departments (e.g., design, marketing, post-production, talent) to coordinate and execute production plans\nProficient in video editing software (e.g., Adobe Premiere, Final Cut Pro) with an eye for pacing, visual storytelling, and sound design.\nAbility to work in a fast-paced environment and make instant, quality decisions\nExcellent interpersonal skills and a demonstrated ability to be an effective leader within own team and across an organization, bridging gaps between departments and creating synergies\nBrings innovative ideas to the table, with a focus on brand value, seamless execution, attainability and highest yield\nDetail-oriented and a logical approach to problem solving\nAbility to lead and mentor producers, editors, and other production staff, fostering collaboration and a high-quality production environment\nA passion for basketball\n\nPhysical Demands: N/A\n\nLocation: El Segundo (offices M-F), downtown Los Angeles (Crypto.com arena for intermittent Lakers home games), other occasional off-site events\n\nTravel: Up to 10% of the time\n\nHours: This position requires continual attention due to the perpetual nature of the NBA season; after-hours time is mandatory; must be available to work evenings, weekends and holidays\n\nThe pay range for this role is $100,000 to $115,000. Actual compensation packages are based on several factors that are unique to each candidate, including but not limited to skill set, depth of experience and certifications.\n\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, age, disability, gender identity, marital or veteran status, or any other protected class.\n\nBy continuing with an application, you agree to the Lakers Applicant Privacy Policy and Notice."
        }
    }
}