{
    "job_details": {
        "job_id": "4112128804",
        "job_title": "Graphic Designer",
        "company": {
            "name": "PriceSenz",
            "location": "Bethesda, MD"
        },
        "job_description": {
            "overview": "Position: Graphic Designer",
            "details": "Location: Bethesda, MD\n\nPosition Summary\nWe are seeking a talented Graphic Designer to join a dynamic team supporting a prominent research and development organization in Bethesda, MD. The ideal candidate will utilize their creativity, technical skills, and communication expertise to develop innovative visual communication materials that effectively convey both technical and non-technical ideas to diverse audiences.\n\nKey Responsibilities:\nCommunication Strategy & Planning:\nDevelop and implement communication strategies that align with organizational goals and objectives.\nCreate visual and written content tailored to various audiences and distribution channels.\nContent Development & Design:\nDesign engaging content, including infographics, scientific posters, internal newsletters, meeting materials, and signage.\nCreate visual communication products such as branding materials, PowerPoint presentations, scientific figures, and illustrations.\nDevelop specialized illustrations and graphics covering complex subject matters for diverse audiences.\nCollaborate on internal and external messaging, highlighting organizational achievements and capabilities.\nMedia & Content Analysis:\nMonitor and evaluate media campaign performance using traditional and social media metrics.\nProvide actionable insights to enhance communication strategies.\nWeb and Social Media Management:\nMaintain and update content on internal and external websites and social media platforms.\nCoordinate photographic and videographic resources to capture and share engaging media content.\nManage site design, content updates, and security protocols for digital platforms.\n\nQualifications\nEducation: Bachelor’s degree in Biology, Molecular Biology, Graphic Design, Commercial Art, or a related field.\nSkills and Expertise:\nProficiency in Microsoft Office Suite, SharePoint, and design tools such as BioRender, Adobe Illustrator, Photoshop, and Canva.\nDemonstrated ability to visually communicate scientific and non-technical ideas to general and specialized audiences.\nStrong written and verbal communication skills.\nAbility to design scientific and technical materials for diverse purposes, including press releases, web content, newsletters, and multimedia scripts.\n\nThis role provides the opportunity to make a meaningful impact by translating scientific achievements into compelling visual and written narratives. If you’re passionate about combining creativity with science to make complex information accessible, we want to hear from you\n\n\n\nPriceSenz is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, or disability."
        }
    }
}